{"data":{"markdownRemark":{"html":"<p>Architecte Logiciel et Système, mon évolution professionnel ainsi que mon parcours entrepreunarial m'ont permis de développer des compétences solides dans la modélisation de systèmes complexe. Cette expérience se refléte dans les projets que j'ai pu mener et que vous pouvez consulter sur mon profil.</p>\n<p>Mon expérience est centrée sur la gestion d'équipes technique, le design d'applications &#x26; de systèmes et la gestion du cycle de vie d'un produit (livraison, qualité, recette, maintenance, production, amélioration...).</p>\n<p>Mon intérêt dans les systèmes informatiques évoluent constamment. Il se porte actuellement sur les architectures cloud, les architectures microservices, les infrastructures kubernetes, les services mesh et les APIs.</p>\n<p>Mes principaux sujets de réflexion qui guident mes explorations sont la scalabilité horizontale, la haute performance, la haute disponibilité et bien entendu la résilience.</p>\n<p>Passionné avant tout d'informatique, je suis développeur php/js/NodeJS/Java/Python (avec bientôt Go comme nouveau compagnon). Ma passion m'amène également à une veille technologique permanente et à l'évaluation de tous les systèmes qui me sont inconnus.</p>\n<p>Je suis également un évangélisateur de l'opensource et je contribue, lorsque le temps le permet, à des projets opensources.</p>","frontmatter":{"firstname":"Romain","lastname":"DARY","title":"Solution & Platform Architect","social":{"website":"https://romain.dary.io","twitter":"https://twitter.com/iam_merlin","linkedin":"https://fr.linkedin.com/in/romaindary","github":"https://github.com/merlindorin","instagram":"https://www.instagram.com/iam_merlin","keybase":"https://keybase.io/merlindorin","medium":"https://medium.com/@iam_merlin"},"avatar":{"childImageSharp":{"resolutions":{"width":96,"height":96,"src":"/static/742066026cbe6b91c6ab6d20218dea2c/9389c/avatar.jpg","srcSet":"/static/742066026cbe6b91c6ab6d20218dea2c/9389c/avatar.jpg 1x,\n/static/742066026cbe6b91c6ab6d20218dea2c/47448/avatar.jpg 1.5x,\n/static/742066026cbe6b91c6ab6d20218dea2c/37692/avatar.jpg 2x,\n/static/742066026cbe6b91c6ab6d20218dea2c/594b0/avatar.jpg 3x"}}}},"fields":{"readingTime":{"time":53700}}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"posts":[{"frontmatter":{"date":"May 12, 2019","path":"/kubernetes-an-humble-introduction","title":"Kubernetes, an humble introduction","excerpt":"In a few years, Kubernetes became The reference orchestrator. It first supplanted Docker Swarm and remains a leader against all its competitors. Behind the hype, we have to understand what Kubernetes enables our organizations to do and why its adoption is crucial.","author":"romain-dary","tags":["digital transformation","development","kubernetes","architecture"]},"fields":{"readingTime":{"time":246300}}},{"frontmatter":{"date":"April 07, 2019","path":"/write-a-technical-blog","title":"Should I write a technical blog","excerpt":"As you do not know, I'm french. So, it's a really bad start for being fluent in English. I also try to improve myself everyday and I practice everything I'm interested in. Maybe starting to write in English is not a so terrible idea for me and","author":"romain-dary","tags":["lifestyle","general"]},"fields":{"readingTime":{"time":78300}}}]}}